using System;

namespace StependNORBIT_Peretyatko_Sergey
{

  
    class TypeText//класс определения эмоциональной окраски входной заявки
    {
        private string txtinput;//входная строка
        private string type;
        private int kolvoP;//количество позитивных токенов
        private int kolvoN;//количество негативных токенов
       
        private string[] listwords;//список для хранения извлекаемых из обращения слов
        //тональные словари
        private string[] LEWn;
        private string[] LEWp;
        private string[] LEWp1;
        public void SetText()//передача обращения для хранения
        {
            txtinput = Console.ReadLine();

        }
        public TypeText()
        {
            txtinput = "";
            type = "";
            kolvoP = 0;
            kolvoN = 0;
            LEWp = new string[400];
            LEWp1 = new string[400]; LEWn = new string[400];
            LEWp[0] = "новый";
            LEWp[1] = "новее";
            LEWp[2] = "новейший"; LEWp[3] = "абсолютно"; LEWp[4] = "адаптируются";
            LEWp[5] = "адаптируется"; LEWp[6] = "адаптируюсь"; LEWp[7] = "адаптируешься"; LEWp[8] = "адаптируетесь";
            LEWp[9] = "аккуратность"; LEWp[10] = "аккуратный"; LEWp[11] = "аккуратнее"; LEWp[12] = "активизировались";
            LEWp[13] = "активизировался"; LEWp[14] = "активизировал"; LEWp[15] = "активизировалась"; LEWp[16] = "активный";
            LEWp[17] = "активнее"; LEWp[18] = "активная"; LEWp[19] = "активнейший"; LEWp[20] = "альтруистический";
            LEWp[21] = "ангельский"; LEWp[22] = "аутентичный"; LEWp[23] = "аутентичнее"; LEWp[24] = "баланс";
            LEWp[25] = "балансный"; LEWp[26] = "безмятежность"; LEWp[27] = "безмятежный"; LEWp[28] = "безмятежнее";
            LEWp[29] = "безмятежная"; LEWp[30] = "безмятежное"; LEWp[31] = "безмятежные"; LEWp[32] = "безопасный";
            LEWp[33] = "безопаснее"; LEWp[34] = "безопаснейший"; LEWp[35] = "бесконечность"; LEWp[36] = "бесконечный";
            LEWp[37] = "бесконечное"; LEWp[38] = "беспристрастный"; LEWp[39] = "беспристрастная"; LEWp[40] = "беспристрастное";
            LEWp[41] = "бесстрашный"; LEWp[42] = "бесстрашное"; LEWp[43] = "бесстрашная"; LEWp[44] = "бесстрашного";
            LEWp[45] = "бесстрашную"; LEWp[46] = "бесстрашному"; LEWp[47] = "бесстрашной"; LEWp[48] = "бесстрашном";
            LEWp[49] = "бесстрашном"; LEWp[50] = "бесценный"; LEWp[51] = "бесценная"; LEWp[52] = "бесценное";
            LEWp[53] = "бесценную"; LEWp[54] = "бесценного"; LEWp[55] = "бесценному"; LEWp[56] = "бесценной";
            LEWp[57] = "благодарная радость"; LEWp[58] = "благодарной радости"; LEWp[59] = "благодарность"; LEWp[60] = "благодарный";
            LEWp[61] = "благодарная"; LEWp[62] = "благодарного"; LEWp[63] = "благодарную"; LEWp[64] = "благодарное";
            LEWp[65] = "благодарно"; LEWp[66] = "благоприятный"; LEWp[67] = "благоприятная"; LEWp[68] = "благоприятное";
            LEWp[69] = "благоприятно"; LEWp[70] = "благоприятную"; LEWp[71] = "благоприятному"; LEWp[72] = "благодарный";
            LEWp[73] = "благодарная"; LEWp[74] = "благодарное"; LEWp[75] = "благодарного"; LEWp[76] = "благодарной";
            LEWp[77] = "благодарном"; LEWp[78] = "благодарные"; LEWp[79] = "благоприятный"; LEWp[80] = "благоприятная";
            LEWp[81] = "благоприятное"; LEWp[82] = "благоприятному"; LEWp[83] = "благоприятной"; LEWp[84] = "благоприятного";
            LEWp[85] = "благоприятным"; LEWp[86] = "благородный"; LEWp[87] = "благородная"; LEWp[88] = "благородное";
            LEWp[89] = "благородного"; LEWp[90] = "благородную"; LEWp[91] = "благородному"; LEWp[92] = "благородной";
            LEWp[93] = "благородным"; LEWp[94] = "благородном"; LEWp[95] = "благосклонный"; LEWp[96] = "благосклонная";
            LEWp[97] = "благосклонное"; LEWp[98] = "благосклонному"; LEWp[99] = "благосклонной"; LEWp[100] = "благосклонным";
            LEWp[101] = "благосклонные"; LEWp[102] = "благосклонных"; LEWp[103] = "благосклонными"; LEWp[104] = "благословения";
            LEWp[105] = "благословлял"; LEWp[106] = "благословлять"; LEWp[107] = "благословить"; LEWp[108] = "благословляли";
            LEWp[109] = "благословляла"; LEWp[110] = "благословляют"; LEWp[111] = "благословляет"; LEWp[112] = "благотворный";
            LEWp[113] = "благотворная"; LEWp[114] = "благотворное"; LEWp[115] = "благотворные"; LEWp[116] = "благотворную";
            LEWp[117] = "благотворного"; LEWp[118] = "благотворным"; LEWp[119] = "благотворных"; LEWp[120] = "блаженный";
            LEWp[121] = "блаженная"; LEWp[122] = "блаженные"; LEWp[123] = "блаженных"; LEWp[124] = "блаженном";
            LEWp[125] = "блаженным"; LEWp[126] = "блаженство"; LEWp[127] = "блаженства"; LEWp[128] = "блестящий";
            LEWp[129] = "блестящая"; LEWp[130] = "блестящее"; LEWp[131] = "блестящую"; LEWp[132] = "блестящем";
            LEWp[133] = "блестящим"; LEWp[134] = "блестящие"; LEWp[135] = "близость"; LEWp[136] = "близкий";
            LEWp[137] = "близкие"; LEWp[138] = "близко"; LEWp[139] = "ближе"; LEWp[140] = "ближайший";
            LEWp[141] = "ближайшая"; LEWp[142] = "ближайшие"; LEWp[143] = "бог"; LEWp[144] = "бодрост";
            LEWp[145] = "бодр"; LEWp[146] = "божественн"; LEWp[147] = "безупречн"; LEWp[148] = "браво";
            LEWp[149] = "буйн"; LEWp[150] = "быстр"; LEWp[151] = "восторг"; LEWp[152] = "центр";
            LEWp[153] = "вау"; LEWp[154] = "вверх"; LEWp[155] = "вдохновен"; LEWp[156] = "вдохновл";
            LEWp[157] = "вдохновля"; LEWp[158] = "вежлив"; LEWp[159] = "везен"; LEWp[160] = "великодушн";
            LEWp[161] = "великолеп"; LEWp[162] = "вера"; LEWp[163] = "вери"; LEWp[164] = "верн";
            LEWp[165] = "вертикаль"; LEWp[166] = "верхуш"; LEWp[167] = "весел"; LEWp[168] = "весёл";
            LEWp[169] = "вечн"; LEWp[170] = "воодушевл"; LEWp[171] = "взращ"; LEWp[172] = "вибриру";
            LEWp[173] = "видн"; LEWp[174] = "вкусн"; LEWp[175] = "власт"; LEWp[176] = "вниматель";
            LEWp[177] = "помнящ"; LEWp[178] = "спокойств"; LEWp[179] = "возвыше"; LEWp[180] = "возлюбленн";
            LEWp[181] = "волшеб"; LEWp[182] = "воображ"; LEWp[183] = "воспит"; LEWp[184] = "восприимч";
            LEWp[185] = "восстановл"; LEWp[186] = "восторг"; LEWp[187] = "восторж"; LEWp[188] = "восхититель";
            LEWp[189] = "восхищ"; LEWp[190] = "впечатл"; LEWp[191] = "всепрощ"; LEWp[192] = "вскормл";
            LEWp[193] = "выбор"; LEWp[194] = "выгод"; LEWp[195] = "выдающ"; LEWp[196] = "выполн";
            LEWp[197] = "гармоничн"; LEWp[198] = "гармон"; LEWp[199] = "гениальн"; LEWp[200] = "годн";
            LEWp[201] = "горд"; LEWp[202] = "готов"; LEWp[203] = "грейс"; LEWp[204] = "дивн";
            LEWp[205] = "динамич"; LEWp[206] = "дипломатичн"; LEWp[207] = "добро пожаловать"; LEWp[208] = "добродетель";
            LEWp[209] = "добродуш"; LEWp[210] = "доброе сердце"; LEWp[211] = "добросовестн"; LEWp[212] = "доброт";
            LEWp[213] = "добрый"; LEWp[214] = "добрая"; LEWp[215] = "добрые"; LEWp[216] = "добрым";
            LEWp[217] = "добрых"; LEWp[218] = "добром"; LEWp[219] = "добрую"; LEWp[220] = "добрыми";
            LEWp[221] = "довер"; LEWp[222] = "довол"; LEWp[223] = "долговечн"; LEWp[224] = "достижен";
            LEWp[225] = "достойн"; LEWp[226] = "драгоценн"; LEWp[227] = "дружб"; LEWp[228] = "дружи";
            LEWp[229] = "дружелюб"; LEWp[230] = "дружн"; LEWp[231] = "духовн"; LEWp[232] = "душа";
            LEWp[233] = "душевн"; LEWp[234] = "един"; LEWp[235] = "желан"; LEWp[236] = "желательн";
            LEWp[237] = "жёстк"; LEWp[238] = "жив"; LEWp[239] = "жизнерадост"; LEWp[240] = "жизнеспособн";
            LEWp[241] = "жизн"; LEWp[242] = "жирн"; LEWp[243] = "забавн"; LEWp[244] = "заботлив";
            LEWp[245] = "забот"; LEWp[246] = "заземлён"; LEWp[247] = "замедлен"; LEWp[248] = "замечательн";
            LEWp[249] = "зарезервирован"; LEWp[250] = "заслуг"; LEWp[251] = "заслуж"; LEWp[252] = "застенч";
            LEWp[253] = "захватывающ"; LEWp[254] = "защищ"; LEWp[255] = "звёздн"; LEWp[256] = "звучащ";
            LEWp[257] = "здоров"; LEWp[258] = "здравомыслящ"; LEWp[259] = "зелён"; LEWp[260] = "знаком";
            LEWp[261] = "знаменит"; LEWp[262] = "знани"; LEWp[263] = "знать"; LEWp[264] = "знает";
            LEWp[265] = "значим"; LEWp[266] = "знаю"; LEWp[267] = "знаем"; LEWp[268] = "знал";
            LEWp[269] = "игрив"; LEWp[270] = "идеал"; LEWp[271] = "идея"; LEWp[272] = "известн";
            LEWp[273] = "изобил"; LEWp[274] = "изобретатель"; LEWp[275] = "изящн"; LEWp[276] = "инновац";
            LEWp[277] = "инстинкт"; LEWp[278] = "интеллект"; LEWp[279] = "интуитивн"; LEWp[280] = "исключительн";
            LEWp[281] = "искренн"; LEWp[282] = "искрит"; LEWp[283] = "искусн"; LEWp[284] = "искусство";
            LEWp[285] = "исцелен"; LEWp[286] = "калян"; LEWp[287] = "качеств"; LEWp[288] = "классич";
            LEWp[289] = "класс"; LEWp[290] = "коммуникативн"; LEWp[291] = "компанейск"; LEWp[292] = "комфорт";
            LEWp[293] = "красив"; LEWp[294] = "краснореч"; LEWp[295] = "красот"; LEWp[296] = "крепк";
            LEWp[297] = "крут"; LEWp[298] = "магия"; LEWp[299] = "магическ"; LEWp[300] = "мастерств";
            LEWp[301] = "мгновенн"; LEWp[302] = "милостив"; LEWp[303] = "мил"; LEWp[304] = "мир";
            LEWp[305] = "многообещ"; LEWp[306] = "молод"; LEWp[307] = "мотиваци"; LEWp[308] = "мощн";
            LEWp[309] = "мудр"; LEWp[310] = "мужеств"; LEWp[311] = "мягкосерд"; LEWp[312] = "наград";
            LEWp[313] = "награжд"; LEWp[314] = "надежд"; LEWp[315] = "надёжн"; LEWp[316] = "намасте";
            LEWp[317] = "напор"; LEWp[318] = "натруальн"; LEWp[319] = "научи"; LEWp[320] = "находчив";
            LEWp[321] = "небес"; LEWp[322] = "небо"; LEWp[323] = "невероятн"; LEWp[324] = "нежн";
            LEWp[325] = "независим"; LEWp[326] = "неимоверн"; LEWp[327] = "необычайн"; LEWp[328] = "неограничен";
            LEWp[329] = "непобедим"; LEWp[330] = "непоколебим"; LEWp[331] = "непреодолим"; LEWp[332] = "непритязат";
            LEWp[333] = "нереальн"; LEWp[334] = "несказанн"; LEWp[335] = "несравненн"; LEWp[336] = "нетерпелив";
            LEWp[337] = "неустойчив"; LEWp[338] = "нирван"; LEWp[339] = "обалденн"; LEWp[340] = "обаятельн";
            LEWp[341] = "обеспечен"; LEWp[342] = "обильн"; LEWp[343] = "обнадёживающ"; LEWp[344] = "обновил";
            LEWp[345] = "обновл"; LEWp[346] = "обожаем"; LEWp[347] = "образн"; LEWp[348] = "общительн";
            LEWp[349] = "объяти"; LEWp1[0] = "огромная важность"; LEWp1[1] = "одобр"; LEWp1[2] = "оживл";
            LEWp1[287] = "окончат"; LEWp1[288] = "омолод"; LEWp1[289] = "определ"; LEWp1[290] = "оптимизм";
            LEWp1[3] = "оптимист"; LEWp1[4] = "оригиналь"; LEWp1[5] = "осведомл"; LEWp1[6] = "освежа";
            LEWp1[7] = "освещённ"; LEWp1[8] = "освобождён"; LEWp1[9] = "ослаблен"; LEWp1[10] = "ослепительн";
            LEWp1[11] = "ослеплённ"; LEWp1[12] = "особ"; LEWp1[13] = "осознан"; LEWp1[14] = "осторожн";
            LEWp1[15] = "остром"; LEWp1[16] = "остроумн"; LEWp1[17] = "отважн"; LEWp1[18] = "откровенн";
            LEWp1[19] = "открыт"; LEWp1[20] = "отлич"; LEWp1[21] = "оценил"; LEWp1[22] = "очарован";
            LEWp1[23] = "очароват"; LEWp1[24] = "памятн"; LEWp1[25] = "первопроход"; LEWp1[26] = "перемешивание";
            LEWp1[27] = "перемещен"; LEWp1[28] = "пикантн"; LEWp1[29] = "питательн"; LEWp1[30] = "побед";
            LEWp1[31] = "победоносн"; LEWp1[32] = "под напряжением"; LEWp1[33] = "подар"; LEWp1[34] = "подготовлен";
            LEWp1[35] = "поддерж"; LEWp1[36] = "подлин"; LEWp1[37] = "позвол"; LEWp1[38] = "поздравл";
            LEWp1[39] = "позитив"; LEWp1[40] = "полирован"; LEWp1[41] = "полновод"; LEWp1[42] = "положительн";
            LEWp1[43] = "нонима"; LEWp1[44] = "поощр"; LEWp1[45] = "популяр"; LEWp1[46] = "поразит";

            LEWp1[47] = "постоянная"; LEWp1[48] = "потрясающ"; LEWp1[49] = "похвал"; LEWp1[50] = "почётн";
            LEWp1[51] = "почитаем"; LEWp1[52] = "правдив"; LEWp1[53] = "праведн"; LEWp1[54] = "право";
            LEWp1[55] = "празднова"; LEWp1[56] = "практическ"; LEWp1[57] = "превосходн"; LEWp1[58] = "превращение";
            LEWp1[59] = "предан"; LEWp1[60] = "предприимчив"; LEWp1[61] = "прекрасн"; LEWp1[62] = "представить";
            LEWp1[63] = "прекрасн"; LEWp1[64] = "преобразую"; LEWp1[65] = "приветлив"; LEWp1[66] = "приветствов";
            LEWp1[67] = "привлекательн"; LEWp1[68] = "признательн"; LEWp1[69] = "приключ"; LEWp1[70] = "прилежн";
            LEWp1[71] = "приличествующ"; LEWp1[72] = "примерка"; LEWp1[73] = "принципиальн"; LEWp1[74] = "принят";
            LEWp1[75] = "приподнят"; LEWp1[76] = "приятн"; LEWp1[77] = "проактивн"; LEWp1[78] = "провозглаш";
            LEWp1[79] = "прогресс"; LEWp1[80] = "продуктивн"; LEWp1[81] = "просветл"; LEWp1[82] = "просвещённ";
            LEWp1[83] = "просто"; LEWp1[84] = "прост"; LEWp1[85] = "процвет"; LEWp1[86] = "процветающ";
            LEWp1[87] = "прочувствованн"; LEWp1[88] = "прощение"; LEWp1[89] = "пузырчат"; LEWp1[90] = "пылать";
            LEWp1[91] = "пылающ"; LEWp1[92] = "пышн"; LEWp1[93] = "равенство"; LEWp1[94] = "радиант";
            LEWp1[95] = "радостн"; LEWp1[96] = "радость"; LEWp1[97] = "разносторонн"; LEWp1[98] = "рай";
            LEWp1[99] = "расширенн"; LEWp1[100] = "рафинированн"; LEWp1[101] = "рациональн"; LEWp1[102] = "рвение";
            LEWp1[103] = "ревностн"; LEWp1[104] = "резв"; LEWp1[105] = "решающ"; LEWp1[106] = "родств";
            LEWp1[107] = "роман"; LEWp1[108] = "романтик"; LEWp1[109] = "роскошн"; LEWp1[110] = "роскош";
            LEWp1[111] = "рост"; LEWp1[112] = "самодисциплинирован"; LEWp1[113] = "самостоятельн"; LEWp1[114] = "самоуверен";
            LEWp1[115] = "сбалансирован"; LEWp1[116] = "свеж"; LEWp1[117] = "сверкающ"; LEWp1[118] = "светл";
            LEWp1[119] = "светящ"; LEWp1[120] = "свобод"; LEWp1[121] = "свят"; LEWp1[122] = "священн";
            LEWp1[123] = "сдача"; LEWp1[124] = "сдержанн"; LEWp1[125] = "сейф"; LEWp1[126] = "сейчас";

            LEWp1[127] = "сенсационн"; LEWp1[128] = "сердечн"; LEWp1[129] = "серьёзн"; LEWp1[130] = "сила";
            LEWp1[131] = "сильн"; LEWp1[132] = "скромн"; LEWp1[133] = "слава"; LEWp1[134] = "славн";
            LEWp1[135] = "сладк"; LEWp1[136] = "случайн"; LEWp1[137] = "смешлив"; LEWp1[138] = "смешн";
            LEWp1[139] = "смеяться"; LEWp1[140] = "смеётся"; LEWp1[141] = "смеются"; LEWp1[142] = "смеялись";
            LEWp1[143] = "смеялась"; LEWp1[144] = "смеётесь"; LEWp1[145] = "смеялся"; LEWp1[146] = "смысл";
            LEWp1[147] = "совершенство"; LEWp1[148] = "соглас"; LEWp1[149] = "содержание"; LEWp1[150] = "соедин";
            LEWp1[151] = "сознан"; LEWp1[152] = "сознат"; LEWp1[153] = "солнечн"; LEWp1[154] = "сообразительн";
            LEWp1[155] = "сопережива"; LEWp1[156] = "сосредоточен"; LEWp1[157] = "состоятельн"; LEWp1[158] = "состоящ";
            LEWp1[159] = "сострада"; LEWp1[160] = "сотрудн"; LEWp1[161] = "сочн"; LEWp1[162] = "сочувствующ";
            LEWp1[163] = "спокойн"; LEWp1[164] = "спокойств"; LEWp1[165] = "способн"; LEWp1[166] = "справедлив";
            LEWp1[167] = "стадн"; LEWp1[168] = "стойк"; LEWp1[169] = "стояч"; LEWp1[170] = "страстн";
            LEWp1[171] = "супер"; LEWp1[172] = "существенн"; LEWp1[173] = "счастлив"; LEWp1[174] = "счасть";
            LEWp1[175] = "творческ"; LEWp1[176] = "текущ"; LEWp1[177] = "тендер"; LEWp1[178] = "тепл";
            LEWp1[179] = "терпелив"; LEWp1[180] = "терпен"; LEWp1[181] = "терпим"; LEWp1[182] = "течь";
            LEWp1[183] = "тих"; LEWp1[184] = "только"; LEWp1[185] = "торжеств"; LEWp1[186] = "трепет";
            LEWp1[187] = "трогатель"; LEWp1[188] = "трудолюбив"; LEWp1[189] = "тщательн"; LEWp1[190] = "убедительн";
            LEWp1[191] = "уважать"; LEWp1[192] = "уверен"; LEWp1[193] = "удачл"; LEWp1[194] = "удивитель";
            LEWp1[195] = "удобн"; LEWp1[196] = "удобр"; LEWp1[197] = "удовлетворительн"; LEWp1[198] = "улыбк";
            LEWp1[199] = "уместн"; LEWp1[200] = "умн"; LEWp1[201] = "умопомрачительн"; LEWp1[202] = "уникальн";
            LEWp1[203] = "упруг"; LEWp1[204] = "ура"; LEWp1[205] = "уравновеш"; LEWp1[206] = "усиленн";

            LEWp1[207] = "усмешк"; LEWp1[208] = "успех"; LEWp1[209] = "успешн"; LEWp1[210] = "утвердительн";
            LEWp1[211] = "утончённ"; LEWp1[212] = "участ"; LEWp1[213] = "учтив"; LEWp1[214] = "фантастическ";
            LEWp1[215] = "феерич"; LEWp1[216] = "феномен"; LEWp1[217] = "филигранн"; LEWp1[218] = "философ";
            LEWp1[219] = "харизм"; LEWp1[220] = "хорош"; LEWp1[221] = "хорошеньк"; LEWp1[222] = "храбр";
            LEWp1[223] = "цвести"; LEWp1[224] = "цветёт"; LEWp1[225] = "цветёшь"; LEWp1[226] = "ценн";
            LEWp1[227] = "чавкан"; LEWp1[228] = "чемпион"; LEWp1[229] = "честн"; LEWp1[230] = "честолюбив";
            LEWp1[231] = "чист"; LEWp1[232] = "чувствительн"; LEWp1[233] = "чувств"; LEWp1[234] = "чудесн";
            LEWp1[235] = "чудо"; LEWp1[236] = "чудотворн"; LEWp1[237] = "чутк"; LEWp1[238] = "шипуч";
            LEWp1[239] = "щедр"; LEWp1[240] = "эгоистич"; LEWp1[241] = "экспансивн"; LEWp1[242] = "экстатическ";
            LEWp1[243] = "элегантн"; LEWp1[244] = "электризующ"; LEWp1[245] = "эмоциональн"; LEWp1[246] = "эмпат";
            LEWp1[247] = "энергичн"; LEWp1[248] = "энерги"; LEWp1[249] = "энтуз"; LEWp1[250] = "этич";
            LEWp1[251] = "эфирн"; LEWp1[252] = "эффективн"; LEWp1[253] = "юмористич"; LEWp1[254] = "юношеск";
            LEWp1[255] = "ярк"; LEWp1[256] = "ясн"; 
            
            LEWp1[257] = "тендер"; LEWp1[258] = "тепл";
            LEWp1[259] = "терпелив"; LEWp1[260] = "терпен"; LEWp1[261] = "терпим"; LEWp1[262] = "течь";
            LEWp1[263] = "тих"; LEWp1[264] = "только"; LEWp1[265] = "торжеств"; LEWp1[266] = "трепет";
            LEWp1[267] = "трогатель"; LEWp1[268] = "трудолюбив"; LEWp1[269] = "тщательн"; LEWp1[270] = "убедительн";
            LEWp1[271] = "уважать"; LEWp1[272] = "уверен"; LEWp1[273] = "удачл"; LEWp1[274] = "удивитель";
            LEWp1[275] = "удобн"; LEWp1[276] = "удобр"; LEWp1[277] = "удовлетворительн"; LEWp1[278] = "улыбк";
            LEWp1[279] = "уместн"; LEWp1[280] = "умн"; LEWp1[281] = "умопомрачительн"; LEWp1[282] = "уникальн";
            LEWp1[283] = "упруг"; LEWp1[284] = "ура"; LEWp1[285] = "уравновеш"; LEWp1[286] = "усиленн";


            LEWn[0] = "авар";
            LEWn[1] = "авиакатасрофа";
            LEWn[2] = "ад"; LEWn[3] = "аннул"; LEWn[4] = "аутсайдер";
            LEWn[5] = "банкротств"; LEWn[6] = "бегств"; LEWn[7] = "бедн"; LEWn[8] = "бес";
            LEWn[9] = "беспокойств"; LEWn[10] = "болезн"; LEWn[11] = "боль"; LEWn[12] = "ведьма";
            LEWn[13] = "вирус"; LEWn[14] = "вмятин"; LEWn[15] = "войн"; LEWn[16] = "гадост";
            LEWn[17] = "гнил"; LEWn[18] = "говно"; LEWn[19] = "голод"; LEWn[20] = "горе";
            LEWn[21] = "горечь"; LEWn[22] = "грибок"; LEWn[23] = "гряз"; LEWn[24] = "дерьм";
            LEWn[25] = "дефолт"; LEWn[26] = "долг"; LEWn[27] = "жертв"; LEWn[28] = "завист";
            LEWn[29] = "запрет"; LEWn[30] = "злост"; LEWn[31] = "измена"; LEWn[32] = "импотенция";
            LEWn[33] = "катастроф"; LEWn[34] = "кораблекрушен"; LEWn[35] = "краж"; LEWn[36] = "крах";
            LEWn[37] = "кризис"; LEWn[38] = "кровпролит"; LEWn[39] = "кровь"; LEWn[40] = "лохатрон";
            LEWn[41] = "лузер"; LEWn[42] = "маньяк"; LEWn[43] = "микроб"; LEWn[44] = "мистик";
            LEWn[45] = "могил"; LEWn[46] = "мошенничеств"; LEWn[47] = "мука"; LEWn[48] = "мучени";
            LEWn[49] = "мышеловк"; LEWn[50] = "наказан"; LEWn[51] = "напряг"; LEWn[52] = "насили";
            LEWn[53] = "негатив"; LEWn[54] = "негодяй"; LEWn[55] = "недееспособн"; LEWn[56] = "ненавист";
            LEWn[57] = "нервозн"; LEWn[58] = "нищет"; LEWn[59] = "обида"; LEWn[60] = "обидн";
            LEWn[61] = "обман"; LEWn[62] = "обязанност"; LEWn[63] = "обязательств"; LEWn[64] = "ограблен";
            LEWn[65] = "одиночеств"; LEWn[66] = "отказ"; LEWn[67] = "отставк"; LEWn[68] = "пени";
            LEWn[69] = "подделк"; LEWn[70] = "подстав"; LEWn[71] = "позор"; LEWn[72] = "полтергейст";
            LEWn[73] = "потеря"; LEWn[74] = "предател"; LEWn[75] = "провал"; LEWn[76] = "проигрыш";
            LEWn[77] = "пропа"; LEWn[78] = "просроч"; LEWn[79] = "пытк"; LEWn[80] = "развод";
            LEWn[81] = "разрушен"; LEWn[82] = "рутин"; LEWn[83] = "самоубийств"; LEWn[84] = "санкц";
            LEWn[85] = "скук"; LEWn[86] = "слабост"; LEWn[87] = "слез"; LEWn[88] = "смерт";
            LEWn[89] = "смрад"; LEWn[90] = "ссор"; LEWn[91] = "страда"; LEWn[92] = "страх";
            LEWn[93] = "стуж"; LEWn[94] = "суд"; LEWn[95] = "сует"; LEWn[96] = "суицид";
            LEWn[97] = "темн"; LEWn[98] = "теракт"; LEWn[99] = "тоск"; LEWn[100] = "трево";
            LEWn[101] = "трус";

            LEWn[102] = "трух";
            LEWn[103] = "тухлятин";
            LEWn[104] = "тюрьм"; LEWn[105] = "тяжест"; LEWn[106] = "убийств";
            LEWn[107] = "урод"; LEWn[108] = "ущерб"; LEWn[109] = "холод"; LEWn[110] = "штраф";
            LEWn[111] = "яд"; LEWn[112] = "язва"; LEWn[113] = "язви"; LEWn[114] = "ведьма";
            LEWn[115] = "вирус"; LEWn[116] = "вмятин"; LEWn[117] = "войн"; LEWn[118] = "гадост";
            LEWn[119] = "гнил"; LEWn[120] = "говно"; LEWn[121] = "голод"; LEWn[122] = "горе";
            LEWn[123] = "горечь"; LEWn[124] = "грибок"; LEWn[125] = "гряз"; LEWn[126] = "дерьм";
            LEWn[127] = "дефолт"; LEWn[128] = "долг"; LEWn[129] = "жертв"; LEWn[130] = "завист";
            LEWn[131] = "запрет"; LEWn[132] = "злост"; LEWn[133] = "измена"; LEWn[134] = "импотенция";
            LEWn[135] = "катастроф"; LEWn[136] = "кораблекрушен"; LEWn[137] = "краж"; LEWn[138] = "крах";
            LEWn[139] = "кризис"; LEWn[140] = "кровпролит"; LEWn[141] = "кровь"; LEWn[142] = "лохатрон";
            LEWn[143] = "лузер"; LEWn[144] = "маньяк"; LEWn[145] = "микроб"; LEWn[146] = "мистик";
            LEWn[147] = "могил"; LEWn[148] = "мошенничеств"; LEWn[149] = "мука"; LEWn[150] = "мучени";
            LEWn[151] = "мышеловк"; LEWn[152] = "наказан"; LEWn[153] = "напряг"; LEWn[154] = "насили";
            LEWn[155] = "негатив"; LEWn[156] = "негодяй"; LEWn[157] = "недееспособн"; LEWn[158] = "ненавист";
            LEWn[159] = "нервозн"; LEWn[160] = "нищет"; LEWn[161] = "обида"; LEWn[162] = "обидн";
            LEWn[163] = "обман"; LEWn[164] = "обязанност"; LEWn[165] = "обязательств"; LEWn[166] = "ограблен";
            LEWn[167] = "одиночеств"; LEWn[168] = "отказ"; LEWn[169] = "отставк"; LEWn[170] = "пени";
            LEWn[171] = "подделк"; LEWn[172] = "подстав"; LEWn[173] = "позор"; LEWn[174] = "полтергейст";
            LEWn[175] = "потеря"; LEWn[176] = "предател"; LEWn[177] = "провал"; LEWn[178] = "проигрыш";
            LEWn[179] = "пропа"; LEWn[180] = "просроч"; LEWn[181] = "пытк"; LEWn[182] = "развод";
            LEWn[183] = "разрушен"; LEWn[184] = "рутин"; LEWn[185] = "самоубийств"; LEWn[186] = "санкц";
            LEWn[187] = "скук"; LEWn[188] = "слабост"; LEWn[189] = "слез"; LEWn[190] = "смерт";
            LEWn[191] = "смрад"; LEWn[192] = "ссор"; LEWn[193] = "страда"; LEWn[194] = "страх";
            LEWn[195] = "стуж"; LEWn[196] = "суд"; LEWn[197] = "сует"; LEWn[198] = "суицид";
            LEWn[199] = "темн"; LEWn[200] = "теракт"; LEWn[201] = "тоск"; LEWn[202] = "трево";
            LEWn[203] = "трус";

            LEWn[204] = "прогульщ";
            LEWn[205] = "зажратьс";
            LEWn[206] = "проболтать"; LEWn[207] = "заложник"; LEWn[208] = "жлоб";
            LEWn[209] = "заносчив"; LEWn[210] = "фальшив"; LEWn[211] = "загрязнённ"; LEWn[212] = "завист";
            LEWn[213] = "придуши"; LEWn[214] = "замёрзн"; LEWn[215] = "протранжирить"; LEWn[216] = "жульнич";
            LEWn[217] = "придрать"; LEWn[218] = "напугать"; LEWn[219] = "грабит"; LEWn[220] = "неуч";
            LEWn[221] = "плох"; LEWn[222] = "отвратительн"; LEWn[223] = "ужасн"; LEWn[224] = "горест";
            LEWn[225] = "ленив"; LEWn[226] = "поражен"; LEWn[227] = "погиб"; LEWn[228] = "умер";
            LEWn[229] = "тоскл"; LEWn[230] = "грустн"; LEWn[231] = "злить"; LEWn[232] = "осужд";
            LEWn[233] = "табу"; LEWn[234] = "груб"; LEWn[235] = "сердит"; LEWn[236] = "скучн";
            LEWn[237] = "раздражит"; LEWn[238] = "скверн"; LEWn[239] = "странн"; LEWn[240] = "стрёмн";
            LEWn[241] = "гадк"; LEWn[242] = "глуп"; LEWn[243] = "никогда"; LEWn[244] = "некогда";
            LEWn[245] = "никого"; LEWn[246] = "некого"; LEWn[247] = "невозможно"; LEWn[248] = "нельзя";
            LEWn[249] = "безобразн"; LEWn[250] = "невыносим"; LEWn[251] = "бечеловечн"; 
        }
    
        public void OprType()//метод анализа на эмоциональную окраску обращения
        {
            
            txtinput = txtinput.ToLower();
            listwords = txtinput.Split(" ");
           for (int k=0; k<listwords.Length; k++)
            {
               // Console.WriteLine(listwords[k].IndexOf("хорошо"));
               for (int i=0; i<350; i++)
                {
                   
                   if (listwords[k].IndexOf(LEWp[i])>-1)
                   kolvoP++;
                }
                for (int i = 0; i < 286; i++)
                {

                    if (listwords[k].IndexOf(LEWp1[i]) > -1)
                        kolvoP++;
                }

                for (int i=0; i<251; i++)
                {
                    if (listwords[k].IndexOf(LEWn[i]) > -1)
                        kolvoN++;
                }
            }
        }
        
        public void showres()//метод вывода результата тонального анализа обращения
        {
            if (kolvoN >= 2)
            {
                Console.WriteLine("Негативный отзыв");
                type = "negative";
            }
            else if (kolvoP >= 2)
            {
                Console.WriteLine("Положительный отзыв");
                type = "positive";
            }
            else
            {
                Console.WriteLine("Нейтральный отзыв");
                type = "neitral";
            }
        }
        
    }
    class Program
    {
        
        static void Main(string[] args)
        {
            TypeText inputtext = new TypeText();
            inputtext.SetText();
            inputtext.OprType();
            inputtext.showres();

        }
    }
}
